using System;
using System.Net;
using System.Net.Sockets;
using System.Text;
using static System.Console;

/*
Задание 2
	Разработайте набор консольных приложений. Первое приложение: серверное приложение, 
    которое на запросы клиента возвращает текущее время или дату на сервере. 
    Второе приложение: клиентское приложение, запрашивающее дату или время. 
    Пользователь с клавиатуры определяет, что нужно запросить. 
    После отсылки даты или времени сервер разрывает соединение. 
    Клиентское приложение отображает полученные данные. 

В данном задании было принято решение использовать асинхронные сокеты, так как синхронные уже были реализованы в предыдущем задании 

Серверная часть
*/

namespace ConsoleServerAsyncSocket
{
    class Program
    {
        static void Main(string[] args)
        {
        }
    }
}
